app/controllers/delete_controller.rb

  def index
  	@book_info = Binfo.find(params[:id])
---
SELECT "binfos".* FROM "binfos" WHERE "binfos"."id" = ? LIMIT 1  [["id", "1"]]

  def del
  	@book_info = Binfo.find(params[:id])
  	@book_info.destroy
---
SELECT "binfos".* FROM "binfos" WHERE "binfos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "binfos" WHERE "binfos"."id" = ?  [["id", 1]]