app/controllers/entry_controller.rb

INSERT INTO "binfos" ("author", "created_at", "date_available", "page", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def new
   if request.post? then
    @datainfo = Binfo.new(
      :title => params['title'],
      :author => params['author'],
      :page => params['page'],
      :date_available => params['date_available']
      )
    if @datainfo.save then