app/controllers/list_controller.rb

SELECT "binfos".* FROM "binfos"
---
  def index
  	@bookinfo = Binfo.all