app/controllers/retrieve_controller.rb

  def find
  	if params[:key].blank?
  	render :action => 'error.html.erb'
    else
  	@b_info = Binfo.where("title like ? OR author like ?", "%#{params[:key]}%", "%#{params[:key]}%")
---
SELECT "binfos".* FROM "binfos" WHERE (title like '%RSpec%' OR author like '%RSpec%')