app/controllers/update_controller.rb

  def index
  	@info = Binfo.find(params[:id])
---
SELECT "binfos".* FROM "binfos" WHERE "binfos"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
   if request.post? then
   	  @info= Binfo.find(params[:id])
      @info.title = params['title']
      @info.author = params['author']
      @info.page = params['page']
      @info.date_available = params['date_available']
    if @info.save then
---
SELECT "binfos".* FROM "binfos" WHERE "binfos"."id" = ? LIMIT 1  [["id", "作りながら学ぶRuby入門 第２版"]]
UPDATE "binfos" SET "title" = 'テストです。', "author" = 'テスト太郎', "updated_at" = '2013-09-04 20:27:12.311061' WHERE "binfos"."id" = 20